[
    {
        "title": "Tetgeleg",
        "logo": "/projects/tetgeleg.png",
        "url": "https://tetgeleg.mn/",
        "text": "Helps students and organizations connect with each other. Gives everyone equal chance for better education and especially those who are in rural area. My part was in the back-office and also the web app, where students can read articles with tips for getting into their dream schools. We even set up events for students to meet up and build a community."
    },
    {
        "title": "Lann",
        "logo": "/projects/lann.png",
        "url": "https://lann.market/",
        "text": "Buy, sell, and trade skins easier and faster. All deals are secured with the highest level protection methods. Our main goal is to make sure all trades are safe and scam-free. We act as a third-party to oversee the trades, ensuring everything is fair and secure."
    },
    {
        "title": "Ubcab",
        "logo": "/projects/ubcab.png",
        "url": "https://ubcab.mn/",
        "text": "A company plans to provide services in the public transport sector, expand its services to enterprises, and launch an IPO. The platform will cater to all types of transportation needs throughout Mongolia 24/7. Additional services, such as hand-to-hand delivery, car rental, and designated drivers, are also available."
    },
    {
        "title": "Ubeats",
        "logo": "/projects/ubeats.png",
        "url": "https://ubeats.mn/",
        "text": "I worked on an office food delivery service, designed to make life easier for busy office workers. Plus, we've got a DarkStore and Darkkitchen, all unnecessary expenses are reduced, and quality food at competitive, affordable prices can be provided and be promptly delivered to your location. It's all about bringing tasty, convenient lunches right to your desk! The cool part is, it's integrated with our cab system, so delivery is super smooth and reliable."
    },
    {
        "title": "Bidend",
        "logo": "/projects/bidend.png",
        "url": "https://bidend.mn/",
        "text": "Intermediary and unnecessary costs will be reduced by offering an open auction platform for trade and asset management, and it will bring increased capital flows and accelerated economic circulation."
    }
]