[
    {
        "title": "Tetgeleg",
        "logo": "/projects/tetgeleg.png",
        "url": "https://tetgeleg.mn/",
        "text": "Scholarship and education support platform used by 500K+ students and organizations. I led the development of the back-office system and contributed to the public web app, building tools for managing applications, content, and events so students can discover opportunities and resources for their dream schools."
    },
    {
        "title": "Lann",
        "logo": "/projects/lann.png",
        "url": "https://lann.market/",
        "text": "Gaming item and skin marketplace where users can buy, sell, and trade securely. I worked on the frontend trading flows and back-office management tools, focusing on clear UX around balances, offers, and trade status to keep transactions safe and transparent."
    },
    {
        "title": "Ubcab",
        "logo": "/projects/ubcab.png",
        "url": "https://ubcab.mn/",
        "text": "Ride-hailing platform with 1M+ users and 45K+ drivers across Mongolia. I contributed to internal tools and admin dashboards that support daily operations, promotions, and driver/user management, helping the product scale while keeping the experience reliable."
    },
    {
        "title": "Ubeats",
        "logo": "/projects/ubeats.png",
        "url": "https://ubeats.mn/",
        "text": "Office food delivery service integrated with UbCab's logistics network. I helped build the ordering and management interfaces that connect DarkStore/DarkKitchen operations with end users, focusing on reliable delivery flows and a clean, easy-to-use UI for busy office workers."
    },
    {
        "title": "Bidend",
        "logo": "/projects/bidend.png",
        "url": "https://bidend.mn/",
        "text": "Real-time auction platform for trade and asset management. I worked on the frontend experience for browsing, bidding, and managing auctions, collaborating with backend engineers to handle high-traffic bidding periods and keep the interface responsive and trustworthy."
    },
    {
        "title": "Forse.io",
        "logo": "/projects/insights.svg",
        "url": "https://insights.forse.io/",
        "text": "DAO analytics web app using Next.js, Express.js, tRPC, Prisma, and PostgreSQL. I implemented dashboards with Headless UI, TailwindCSS, and ECharts, and integrated Web3 features (wallet connect and on-chain DAO metrics) via Thirdweb, including migrating from wagmi to simplify and stabilize wallet flows."
    }
]